In [12]:
import numpy as np
import pandas as pd

# for multiple output in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Pandas Dataframe size adjust
pd.set_option('display.float_format', lambda x: '%.3f' % x)
pd.options.display.max_columns = 100000000000

In [13]:
!pip install finance_datareader == 0.9.1

zsh:1: = not found

In [14]:
import FinanceDataReader as fdr

In [17]:
# SAMSUNG EREC
df1 = fdr.DataReader("005930", '2018-01-02', '2018-10-30')

# KODEX 200 (ETF)
df2 = fdr.DataReader("069500", '2018-01-03', '2018-10-30')

In [16]:
df1.head(2)
df1.tail(2)

             Open   High    Low  Close  Volume  Change
Date
2018-01-02  51380  51400  50780  51020  169485   0.001
2018-01-03  52540  52560  51420  51620  200270   0.012

             Open   High    Low  Close    Volume  Change
Date
2018-10-29  40850  41950  40550  41400  14460521   0.010
2018-10-30  41400  43000  41000  42350  14205190   0.023

In [18]:
df2.head(2)
df2.tail(2)

             Open   High    Low  Close   Volume  Change
Date
2018-01-03  29789  29879  29717  29794  7397158   0.004
2018-01-04  29960  29974  29547  29558  9094362  -0.008

             Open   High    Low  Close   Volume  Change
Date
2018-10-29  24249  24411  23925  23974  5408544  -0.008
2018-10-30  23938  24353  23852  24140  8172725   0.007

In [20]:
# SAMSUNG EREC
df1 = fdr.DataReader("005930", '2018-01-02', '2018-10-30')

# KODEX 200 (ETF)
df2 = fdr.DataReader("069500", '2018-01-02', '2018-10-30')

In [21]:
df1.shape
df2.shape

(202, 6)

(202, 6)

In [22]:
df2 = df2.drop(pd.to_datetime("2018-01-03"))
df2.head()

             Open   High    Low  Close   Volume  Change
Date
2018-01-02  29643  29731  29552  29667  5117685   0.004
2018-01-04  29960  29974  29547  29558  9094362  -0.008
2018-01-05  29631  29951  29631  29960  8285760   0.014
2018-01-08  30078  30202  29910  30161  8185469   0.007
2018-01-09  30069  30284  29906  30043  8131525  -0.004

In [23]:
df1.head()

             Open   High    Low  Close  Volume  Change
Date
2018-01-02  51380  51400  50780  51020  169485   0.001
2018-01-03  52540  52560  51420  51620  200270   0.012
2018-01-04  52120  52180  50640  51080  233909  -0.010
2018-01-05  51300  52120  51200  52120  189623   0.020
2018-01-08  52400  52520  51500  52020  167673  -0.002

In [24]:
new_df2 = df2.reindex(df1.index)
new_df2.head()

                Open      High       Low     Close      Volume  Change
Date
2018-01-02 29643.000 29731.000 29552.000 29667.000 5117685.000   0.004
2018-01-03       NaN       NaN       NaN       NaN         NaN     NaN
2018-01-04 29960.000 29974.000 29547.000 29558.000 9094362.000  -0.008
2018-01-05 29631.000 29951.000 29631.000 29960.000 8285760.000   0.014
2018-01-08 30078.000 30202.000 29910.000 30161.000 8185469.000   0.007

In [25]:
df1.shape
new_df2.shape

(202, 6)

(202, 6)

In [26]:
new_df2.fillna(method="ffill")

                Open      High       Low     Close       Volume  Change
Date
2018-01-02 29643.000 29731.000 29552.000 29667.000  5117685.000   0.004
2018-01-03 29643.000 29731.000 29552.000 29667.000  5117685.000   0.004
2018-01-04 29960.000 29974.000 29547.000 29558.000  9094362.000  -0.008
2018-01-05 29631.000 29951.000 29631.000 29960.000  8285760.000   0.014
2018-01-08 30078.000 30202.000 29910.000 30161.000  8185469.000   0.007
...              ...       ...       ...       ...          ...     ...
2018-10-24 25211.000 25232.000 24910.000 24957.000 12341624.000  -0.005
2018-10-25 24435.000 24567.000 24198.000 24559.000 11915764.000  -0.016
2018-10-26 24581.000 24586.000 23947.000 24169.000  8396849.000  -0.016
2018-10-29 24249.000 24411.000 23925.000 23974.000  5408544.000  -0.008
2018-10-30 23938.000 24353.000 23852.000 24140.000  8172725.000   0.007

[202 rows x 6 columns]